33-rails-api/pokemon-api/app/controllers/api/v1/pokemons_controller.rb

  def create
    @user = User.find_by({email: params[:email]})
    @pokemon = Pokemon.new(
      name: params[:name],
      image: params[:image],
      user: @user
    )

    if @pokemon.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nicolas@email.com"], ["LIMIT", 1]]
INSERT INTO "pokemons" ("user_id", "name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_pokemon
      @pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]