44-react-auth-part-1/auth-server/app/controllers/api/v1/users_controller.rb

  def signin
    user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Nicolas"], ["LIMIT", 1]]

  def validate
    token = request.headers['Authorization'].to_i
    user = User.find(token)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]